# RoomUpperOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoomUpperOffset Property
ParameterTypeId Class See Also
---
"Limit Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoomUpperOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomUpperOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoomUpperOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace